const classifyMsgSymTyp = (symTypCod) => {
  const classify = {
    Y000: '응급실',
    Y0010: '[재관류중재술] 심근경색',
    Y0020: '[재관류중재술] 뇌경색',
    Y0031: '[뇌출혈수술] 거미막하출혈',
    Y0032: '[뇌출혈수술] 거미막하출혈 외',
    Y0041: '[대동맥응급] 흉부',
    Y0042: '[대동맥응급] 복부',
    Y0051: '[담낭담관질환] 담낭질환',
    Y0052: '[담낭담관질환] 담도포함질환',
    Y0060: '[복부응급수술] 비외상',
    Y0070: '[장중첩/폐색] 영유아',
    Y0081: '[응급내시경] 성인 위장관',
    Y0082: '[응급내시경] 영유아 위장관',
    Y0091: '[응급내시경] 성인 기관지',
    Y0092: '[응급내시경] 영유아 기관지',
    Y0100: '[저출생체중아] 집중치료',
    Y0111: '[산부인과응급] 분만',
    Y0112: '[산부인과응급] 산과수술',
    Y0113: '[산부인과응급] 부인과수술',
    Y0120: '[중증화상] 전문치료',
    Y0131: '[사지접합] 수족지접합',
    Y0132: '[사지접합] 수족지접합 외',
    Y0141: '[응급투석] HD',
    Y0142: '[응급투석] CRRT',
    Y0150: '[정신과적응급] 폐쇄병동입원',
    Y0160: '[안과적수술] 응급',
    Y0171: '[영상의학혈관중재] 성인',
    Y0172: '[영상의학혈관중재] 영유아',
  };

  return classify[symTypCod] || '알수없음';
};

export { classifyMsgSymTyp };
